cfg.org
#+TITLE: Ju' Emacs config

* Bootstrap
** early-init.el
:PROPERTIES:
:header-args: :noweb-ref early-init-cfg
:END:

#+BEGIN_SRC elisp :tangle early-init.el :noweb-ref :noweb yes
;; -*- lexical-binding: t; -*-

<<early-init-cfg>>

;;; early-init.el ends here.
#+END_SRC

#+begin_src elisp
  ;; test
#+end_src

** Core lib
