layers/completion.el
;; -*- lexical-binding: t; -*-
(require 'core-packages)

(use-package cape
  :ensure t
  :init
  (pushnew! completion-at-point-functions
            #'cape-file
            #'cape-abbrev
            #'cape-history))
