cfg.org
*** corfu
#+begin_src elisp
  (use-package corfu
    :ensure (corfu :files (:defaults "extensions/*.el"))
    :hook
    ((prog-mode-hook . corfu-mode)
     (shell-mode-hook . corfu-mode)
     (eshell-mode-hook . corfu-mode)
     (eglot-managed . corfu-mode))
    :config
    (defun corfu-enable-in-minibuffer ()
      (when (where-is-internal #'completion-at-point (list (current-local-map)))
        ;; (setq-local corfu-auto nil) ;; Enable/disable auto completion
        (setq-local corfu-echo-delay nil ;; Disable automatic echo and popup
                    corfu-popupinfo-delay nil)
        (corfu-mode 1)))

    (dolist (c '(minibuffer-setup-hook eshell-mode-hook))
      (add-hook c #'corfu-enable-in-minibuffer))

    (csetq corfu-auto t
           corfu-preview-current nil
           corfu-quit-no-match nil
           corfu-auto-delay 0.15
           corfu-indexed-start 1
           corfu-auto-prefix 3)

    (dolist (c (list (cons "SPC" " ")
                     (cons "." ".")
                     (cons "C-(" "\\(")
                     (cons "C-)" "\\)")
                     (cons "C-[" "\\[")
                     (cons "C-]" "\\]")
                     (cons "=" "=")
                     (cons ":" ":")
                     (cons "C-{" "\\[")
                     (cons "C-}" "\\]")
                     (cons "," ",")
                     (cons "-" "-")
                     (cons ":" ":")
                     (cons ")" ")")
                     (cons "}" "}")
                     (cons "]" "]")))
      (define-key corfu-map (kbd (car c)) `(lambda ()
                                             (interactive)
                                             #'(corfu-quit)
                                             (insert ,(cdr c)))))

    (pushnew! savehist-additional-variables 'corfu-history)

    ;; (defmacro generate-corfu-select-index! (index)
    ;;   "return a named function to run `corfu-complete' for index."
    ;;   `(defun! ,(intern (format "ju-corfu-enter-index-%s" index)) ()
    ;;      ,(format "call `corfu-complete' for index %s." index)
    ;;      (interactive)
    ;;      (let ((corfu--index ,index))
    ;;        (corfu-complete))))

    (map corfu-map
         "C-SPC" #'corfu-insert-separator
         "C-h" #'corfu--popup-show
         "C-t" #'corfu-insert
         "C-n" #'corfu-next
         "C-p" #'corfu-previous
         "C-l" #'corfu-complete
         "C-v" #'corfu-scroll-down
         "C-S-v" #'corfu-scroll-up
         "<tab>" #'corfu-complete

         "<return>" #'(lambda () (interactive)
                        (corfu-complete)
                        (call-interactively #'newline))

         "ESC" (defun corfu-quit-minibuffer ()
                 "`escape-quit-minibuffer' but quit corfu if active."
                 (interactive)
                 (when (and (boundp 'corfu--frame)
                            (frame-live-p corfu--frame))
                   (corfu-quit))
                 (keyboard-quit))))
#+end_src

*** utils
**** Orderless
#+begin_src elisp
  (use-package orderless
    :ensure t
    :init
    (csetq completion-styles '(orderless partial-completion basic)
           completion-category-defaults nil
           completion-category-overrides '((file     (styles orderless partial-completion))
                                           ;; enable initialism by default for symbols
                                           (symbol   (styles orderless))
                                           (command  (styles orderless))
                                           (variable (styles orderless)))
           orderless-component-separator #'orderless-escapable-split-on-space ;; allow escaping space with backslash!
           orderless-style-dispatchers (list #'+orderless-consult-dispatch
                                             #'orderless-affix-dispatch))
    :config
    (defvar ju/orderless--separator "[ &]")

    (setq orderless-matching-styles
          '(orderless-literal
            orderless-prefixes
            orderless-initialism
            orderless-regexp))

    :preface
    (defun orderless-fast-dispatch (word index total)
      (and (= index 0) (= total 1) (length< word 1)
           `(orderless-regexp . ,(concat "^" (regexp-quote word)))))

    (defun +orderless-consult-dispatch (word _index _total)
      (cond
       ;; Ensure that $ works with Consult commands, which add disambiguation suffixes
       ((string-suffix-p "$" word)
        `(orderless-regexp . ,(concat (substring word 0 -1) (+orderless--consult-suffix))))
       ;; File extensions
       ((and (or minibuffer-completing-file-name
                 (derived-mode-p 'eshell-mode))
             (string-match-p "\\`\\.." word))
        `(orderless-regexp . ,(concat "\\." (substring word 1) (+orderless--consult-suffix)))))))
#+end_src

**** Prescient
#+begin_src elisp
  (use-package prescient)
#+end_src

**** Sudo
#+begin_src elisp
  (use-package sudo-utils)
#+end_src

**** Spacious padding
#+begin_src elisp
  (use-package spacious-padding
    :init
    (when (require 'spacious-padding nil t)
      (csetq spacious-padding-widths
             '( :internal-border-width 15
                :header-line-width 4
                :tab-width 4
                :right-divider-width 30
                :scroll-bar-width 8))
      (spacious-padding-mode 1)))
#+end_src

