layers/completion.el
  :ensure (consult :files (:defaults "consult-*"))
  :defer 0
  :init
  (advice-add #'register-preview :override #'consult-register-window)
  (setq register-preview-delay 0.5
        register-preview-function #'consult-register-format)

  :config
  (map leader-map "SPC" #'switch-to-buffer)
  (map ju-menu-map "C-r" #'projectile-recentf-files)
  (global-map
   "M-s o"   #'consult-org-heading
   "C-s"     #'consult-line
   "M-h"     #'consult-buffer
   "C-x C-r" #'consult-recent-file)

  ;; orderless configuration
  (defun +orderless--consult-suffix ()
    "Regexp which matches the end of string with Consult tofu support."
    (if (and (boundp 'consult--tofu-char) (boundp 'consult--tofu-range))
        (format "[%c-%c]*$"
                consult--tofu-char
                (+ consult--tofu-char consult--tofu-range -1))
      "$"))

  ;; Recognizes the following patterns:
  ;; * .ext (file extension)
  ;; * regexp$ (regexp matching at end)



  ;; ----------------------------------------------------------
  ;; Use consult-ripgrep instead of project-find-regexp in project.el
  (keymap-substitute project-prefix-map #'project-find-regexp #'consult-ripgrep)

  (cl-nsubstitute-if
   '(consult-ripgrep "Find regexp")
   (pcase-lambda (`(,cmd _)) (eq cmd #'project-find-regexp))
   project-switch-commands)

  ;; Org Capture
  (defun consult-org-capture-target (scope)
    "Choose a capture target interactively.
This function returns a value suitable for use as the `target'
entry of `org-capture-templates'.  SCOPE is as in `org-map-entries'."
    (list 'function
          (lambda ()
            (let ((consult--read-config `((,this-command
                                           :prompt "Capture target: "
                                           :preview-key "M-."))))
              (set-buffer (save-window-excursion
                            (consult-org-heading nil scope)
                            (current-buffer)))))))

  (set 'org-capture-templates
       `(("c" "Consult..." entry ,(consult-org-capture-target 'agenda)
          "* TODO %?\n  %i" :prepend t)))

  (defun consult-org-capture ()
    (interactive)
    (org-capture nil "c"))

  ;; -----------------------
  ;; unique path for recentf
  (defun my-consult--source-recentf-items-uniq ()
    (let ((ht (consult--buffer-file-hash))
          file-name-handler-alist ;; No Tramp slowdown please.
          items)
      (dolist (file (my-recentf-list-uniq) (nreverse items))
        ;; Emacs 29 abbreviates file paths by default, see
        ;; `recentf-filename-handlers'.
        (unless (eq (aref (cdr file) 0) ?/)
          (setcdr file (expand-file-name (cdr file))))
        (unless (gethash (cdr file) ht)
          (push (propertize
                 (car file)
                 'multi-category `(file . ,(cdr file)))
                items)))))

  (plist-put consult--source-recent-file
             :items #'my-consult--source-recentf-items-uniq)

  (defun my-recentf-list-uniq ()
    (let* ((proposed (mapcar (lambda (f)
                               (cons (file-name-nondirectory f) f))
                             recentf-list))
           (recentf-uniq proposed)
           conflicts resol file)
      ;; collect conflicts
      (while proposed
        (setq file (pop proposed))
        (if (assoc (car file) conflicts)
            (push (cdr file) (cdr (assoc (car file) conflicts)))
          (if (assoc (car file) proposed)
              (push (list (car file) (cdr file)) conflicts))))
      ;; resolve conflicts
      (dolist (name conflicts)
        (let* ((files (mapcar (lambda (f)
                                ;; data structure:
                                ;; (file remaining-path curr-propos)
                                (list f
                                      (file-name-directory f)
                                      (file-name-nondirectory f)))
                              (cdr name)))
               (curr-step (mapcar (lambda (f)
                                    (file-name-nondirectory
                                     (directory-file-name (cadr f))))
                                  files)))
          ;; Quick check, if there are no duplicates, we are done.
          (if (eq (length curr-step) (length (seq-uniq curr-step)))
              (setq resol
                    (append resol
                            (mapcar (lambda (f)
                                      (cons (car f)
                                            (file-name-concat
                                             (file-name-nondirectory
                                              (directory-file-name (cadr f)))
                                             (file-name-nondirectory (car f)))))
                                    files)))
            (while files
              (let (files-remain)
                (dolist (file files)
                  (let ((curr-propos (caddr file))
                        (curr-part (file-name-nondirectory
                                    (directory-file-name (cadr file))))
                        (rest-path (file-name-directory
                                    (directory-file-name (cadr file))))
                        (curr-step
                         (mapcar (lambda (f)
                                   (file-name-nondirectory
                                    (directory-file-name (cadr f))))
                                 files)))
                    (cond ((length= (seq-uniq curr-step) 1)
                           ;; If all elements of curr-step are equal, we skip
                           ;; this path part.
                           (push (list (car file)
                                       rest-path
                                       curr-propos)
                                 files-remain))
                          ((member curr-part (cdr (member curr-part curr-step)))
                           ;; There is more than one curr-part in curr-step
                           ;; for this candidate.
                           (push (list (car file)
                                       rest-path
                                       (file-name-concat curr-part curr-propos))
                                 files-remain))
                          (t
                           ;; There is no repetition of curr-part in curr-step
                           ;; for this candidate.
                           (push (cons (car file)
                                       (file-name-concat curr-part curr-propos))
                                 resol)))))
                (setq files files-remain))))))
      ;; apply resolved conflicts
      (let (items)
        (dolist (file recentf-uniq (nreverse items))
          (let ((curr-resol (assoc (cdr file) resol)))
            (if curr-resol
                (push (cons (cdr curr-resol) (cdr file)) items)
              (push file items)))))))
  ;; -----------------------
  (with-eval-after-load 'exwm
    (wm-map "M-y" #'consult-yank-from-kill-ring))

  (defun my/consult-line-forward ()
    "Search for a matching line forward."
    (interactive)
    (consult-line))

  (defun my/consult-line-backward ()
    "Search for a matching line backward."
    (interactive)
    (advice-add 'consult--line-candidates :filter-return 'reverse)
    (vertico-reverse-mode +1)
    (unwind-protect (consult-line)
      (vertico-reverse-mode -1)
      (advice-remove 'consult--line-candidates 'reverse)))

  (consult-customize my/consult-line-backward
                     :prompt "Go to line backward: ")
  (consult-customize my/consult-line-forward
                     :prompt "Go to line forward: ")

  (global-set-key (kbd "C-s") 'my/consult-line-forward)

  ;; ------------------------------------------------------
  (require 'cl-lib)
  (require 'dom)
  (require 'url-util)
  (require 'xml)

  (defun consult--xdg-recent-file-list ()
    "Get a list of recently used files on XDG-compliant systems.

This function extracts a list of files from the file
`recently-used.xbel' in the folder `xdg-data-home'.

For more information on this specification, see
https://www.freedesktop.org/wiki/Specifications/desktop-bookmark-spec/"
    (let ((data-file (expand-file-name "recently-used.xbel" (xdg-data-home)))
          (xml-parsing-func (if (libxml-available-p)
                                #'libxml-parse-xml-region
                              #'xml-parse-region)))
      (if (file-readable-p data-file)
          (delq nil
                (mapcar (lambda (bookmark-node)
                          (when-let ((local-path (string-remove-prefix
                                                  "file://"
                                                  (dom-attr bookmark-node 'href))))
                            (let ((full-file-name (decode-coding-string
                                                   (url-unhex-string local-path)
                                                   'utf-8)))
                              (when (file-exists-p full-file-name)
                                full-file-name))))
                        (nreverse (dom-by-tag (with-temp-buffer
                                                (insert-file-contents data-file)
                                                (funcall xml-parsing-func
                                                         (point-min)
                                                         (point-max)))
                                              'bookmark))))
        (message "consult: List of XDG recent files not found")
        '())))

  (defun consult--recent-system-files ()
    "Return a list of files recently used by the system."
    (cl-case system-type
      (gnu/linux
       (consult--xdg-recent-file-list))
      (t
       (message "consult-recent-file: \"%s\" currently unsupported"
                system-type)
       '())))

  (defcustom consult-include-system-recent-files t
    "Whether to include files used by other programs in `consult-recent-file'."
    :type 'boolean
    :group 'consult)

  (defun consult--recent-files-mixed-candidates ()
    "Return a list of files recently used by Emacs and the system.

These files are sorted by modification time, from most recent to least."
    (thread-last
      (consult--recent-system-files)
      (seq-filter #'recentf-include-p)
      (append (mapcar #'substring-no-properties recentf-list))
      delete-dups
      (consult--recent-files-sort)))

  (defun consult--recent-files-sort (file-list)
    "Sort the FILE-LIST by modification time, from most recent to least recent."
    (thread-last
      file-list
      ;; Use modification time, since getting file access time seems to count as
      ;; accessing the file, ruining future uses.
      (mapcar (lambda (f)
                (cons f (file-attribute-modification-time (file-attributes f)))))
      (seq-sort (pcase-lambda (`(,f1 . ,t1) `(,f2 . ,t2))
                  ;; Want existing, most recent, local files first.
                  (cond ((or (not (file-exists-p f1))
                             (file-remote-p f1))
                         nil)
                        ((or (not (file-exists-p f2))
                             (file-remote-p f2))
                         t)
                        (t (time-less-p t2 t1)))))
      (mapcar #'car)))

  ;;;###autoload
  (defun consult-recent-file ()
    "Find recent using `completing-read'."
    (interactive)
    (find-file
     (consult--read
      (or (mapcar #'abbreviate-file-name
                  recentf-list)
          (user-error "No recent files"))
      :prompt "Find recent file: "
      :sort nil
      :require-match t
      :category 'file
      :state (consult--file-preview)
      :history 'file-name-history)))

  (defun define-minibuffer-key (key &rest defs)
    "Define KEY conditionally in the minibuffer.
DEFS is a plist associating completion categories to commands."
    (define-key minibuffer-local-map key
                (list 'menu-item nil defs :filter
                      (lambda (d)
                        (plist-get d (completion-metadata-get
                                      (completion-metadata (minibuffer-contents)
                                                           minibuffer-completion-table
                                                           minibuffer-completion-predicate)
                                      'category))))))

  (define-minibuffer-key "\C-s"
                         'consult-location #'previous-history-element
                         'file #'consult-find-for-minibuffer)

  (defun consult-find-for-minibuffer ()
    "Search file with find, enter the result in the minibuffer."
    (interactive)
    (require 'consult)
    (let* ((enable-recursive-minibuffers t)
           (default-directory (file-name-directory (minibuffer-contents)))
           (file (consult--find
                  (replace-regexp-in-string
                   "\\s-*[:([].*"
                   (format " (via find in %s): " default-directory)
                   (minibuffer-prompt))
                  (consult--find-make-builder)
                  (file-name-nondirectory (minibuffer-contents)))))
      (delete-minibuffer-contents)
      (insert (expand-file-name file default-directory))
      (exit-minibuffer))))

(use-package consult-gh ; Consult Github
  :after consult
  :ensure (:host github :repo "armindarvish/consult-gh"))

(use-package consult-dir
  :ensure t
  :bind (("C-x C-d" . consult-dir)
         :map minibuffer-local-completion-map
         ("C-x C-d" . consult-dir)
         ("C-x C-j" . consult-dir-jump-file)))
