cfg.org
*** Vertico
#+begin_src elisp

  (use-package vertico
    :ensure t
    :hook ((elpaca-after-init-hook . vertico-mode)
           (minibuffer-setup-hook  . vertico-repeat-save))
    :init
    (vertico-mode 1)
    (vertico-mouse-mode 1)
    (vertico-multiform-mode 1)
    (vertico-indexed-mode 1)
    ;; (vertico-buffer-mode) ;; Not so seamslesly
    (pushnew! savehist-additional-variables 'vertico-repeat-history)
    :config
    (csetq vertico-count 10
           vertico-scroll-margin 8
           vertico-resize t
           vertico-cycle t
           vertico-indexed-start 1) ;; TODO Set this to 0 and change macro impl below

    ;; Vertico Buffer settings
    (when vertico-buffer-mode
      (csetq vertico-buffer-display-action
             '(display-buffer-at-bottom (window-height . 11)))
      (add-hook 'minibuffer-setup-hook (lambda () (setq mode-line-format nil))))

    (csetq vertico-buffer-display-action '(display-buffer-reuse-window)) ; Default

    (csetq vertico-sort-function #'sort-directories-first)

    (csetq vertico-multiform-commands
           '((describe-symbol (vertico-sort-function . vertico-sort-alpha))))
    (csetq vertico-multiform-categories
           '((symbol (vertico-sort-function . vertico-sort-alpha))
             (consult-grep buffer)))

    (defadvice vertico-insert
        (after vertico-insert-add-history activate)
      "Make vertico-insert add to the minibuffer history."
      (unless minibuffer-history-variable
        (add-to-history minibuffer-history-variable (minibuffer-contents))))

    ;; Make sure vertico state is saved
    ;; so commands `vertico-repeat-last' and `vertico-repeat-select' can be useful.
    (add-hook 'minibuffer-setup-hook #'vertico-repeat-save)

    ;; Clear input when inserting a new path with `/' or `~/'
    (add-hook 'rfn-eshadow-update-overlay-hook #'vertico-directory-tidy)

    (dolist (c (list (cons "SPC" " ")
                     (cons "." ".")
                     (cons "C-(" "\\(")
                     (cons "C-)" "\\)")
                     (cons "C-[" "\\[")
                     (cons "C-]" "\\]")
                     (cons "=" "=")
                     (cons ":" ":")
                     (cons "C-1" "(")
                     (cons "C-7" "[")
                     (cons "C-5" "{")
                     (cons "C-3" "}")
                     (cons "C-2" ")")
                     (cons "C-]" "]")))
      (define-key vertico-map (kbd (car c)) `(lambda ()
                                               (interactive)
                                               (insert ,(cdr c)))))

    ;; (defmacro generate-vertico-select-index! (index)
    ;;   "Return a named function to run `vertico-enter' for INDEX."
    ;;   `(defun! ,(intern (format "vertico-enter-index-%s" index)) ()
    ;;      ,(format "Call `vertico-enter' for index %s." index)
    ;;      (interactive)
    ;;      (let ((vertico--index ,index))
    ;;        (vertico-directory-enter))))

    (map vertico-map
         "ESC" nil ;; necessary to avoid prefix errors (TESTING)
         "C-l" #'vertico-repeat-last
         "C-," #'vertico-repeat-select
         "C-p" #'vertico-previous
         "C-n" #'vertico-next
         "C-h" (cmds! (eq 'file (vertico--metadata-get 'category)) #'vertico-directory-up)
         "C-o" #'vertico-first
         "C-w" #'vertico-save

         ;; Scrolling
         "C-v" (lambda () (interactive) (vertico-scroll-down -1))
         "M-v" (lambda () (interactive) (vertico-scroll-down 1))

         "<tab>" #'vertico-insert

         "<return>" #'vertico-directory-enter
         "M-<return>" #'vertico-exit-input ;; insert what is on input and close
         "<backspace>" #'vertico-directory-delete-char
         "C-<backspace>" #'vertico-directory-delete-word
         "<escape>" #'escape ;; Restore ESC behavior
         )

    ;; Sort directories before files
    (defun sort-directories-first (files)
      (setq files (vertico-sort-history-length-alpha files))
      (nconc (seq-filter (lambda (x) (string-suffix-p "/" x)) files)
             (seq-remove (lambda (x) (string-suffix-p "/" x)) files)))

    ;; Prefix the current candidate with  . From
    ;; https://github.com/minad/vertico/wiki#prefix-current-candidate-with-arrow
    (advice-add #'vertico--format-candidate :around
                (lambda (orig cand prefix suffix index _start)
                  (setq cand (funcall orig cand prefix suffix index _start))
                  (concat
                   (if (= vertico--index index)
                       (propertize " " 'face 'vertico-current)
                     "  ")
                   cand)))

    (defvar +vertico-transform-functions nil)

    (cl-defmethod vertico--format-candidate :around
      (cand prefix suffix index start &context ((not +vertico-transform-functions) null))
      (dolist (fun (ensure-list +vertico-transform-functions))
        (setq cand (funcall fun cand)))
      (cl-call-next-method cand prefix suffix index start))

    (defun +vertico-highlight-directory (file)
      "If FILE ends with a slash, highlight it as a directory."
      (if (string-suffix-p "/" file)
          (propertize file 'face 'marginalia-file-priv-dir) ; or face 'dired-directory
        file))

    ;; function to highlight enabled modes similar to counsel-M-x
    (defun +vertico-highlight-enabled-mode (cmd)
      "If MODE is enabled, highlight it as font-lock-constant-face."
      (let ((sym (intern cmd)))
        (if (or (eq sym major-mode)
                (and
                 (memq sym minor-mode-list)
                 (boundp sym)))
            (propertize cmd 'face 'font-lock-constant-face)
          cmd)))

    ;; add-to-list works if 'file isn't already in the alist
    ;; setq can be used but will overwrite all existing values
    (add-to-list 'vertico-multiform-categories
                 '(file
                   ;; this is also defined in the wiki, uncomment if used
                   ;; (vertico-sort-function . sort-directories-first)
                   (+vertico-transform-functions . +vertico-highlight-directory))))

  (use-package vertico-prescient
    :after vertico
    :demand t
    :config
    (setq vertico-prescient-enable-filtering nil)
    (vertico-prescient-mode))

  (use-package vertico-posframe
    :after vertico
    :config
    (vertico-posframe-mode)
    (csetq posframe-mouse-banish-function #'posframe-mouse-banish-simple))
#+end_src

