cfg.org
** UI
:PROPERTIES:
:header-args: :noweb-ref ui-cfg
:END:

#+BEGIN_SRC elisp :tangle layers/ui.el :noweb-ref :noweb yes
  ;; -*- lexical-binding: t; -*-

  <<ui-cfg>>

  (provide 'ui)
#+END_SRC

#+begin_src elisp
  (require 'core-lib)
  (require 'core-packages)

  (use-package beacon
    :ensure t
    :hook (beacon-mode . prog-mode-hook))

  (use-package doom-modeline
    :init (doom-modeline-mode 1))
#+end_src

