layers/ui.el
;; -*- lexical-binding: t; -*-

(require 'core-lib)
(require 'core-packages)

(use-package beacon
  :ensure t
  :hook (beacon-mode . prog-mode-hook))

(use-package doom-modeline
  :init (doom-modeline-mode 1))
