cfg.org
** Org/notes
:PROPERTIES:
:header-args: :noweb-ref notes-cfg
:END:

#+BEGIN_SRC elisp :tangle layers/notes.el :noweb-ref :noweb yes
;; -*- lexical-binding: t; -*-
(require '+org)

<<notes-cfg>>

(provide 'notes)
#+END_SRC

Early on, as always, we will enable lexical-binding for a better
environment binding and this way be less prone to bugs and allowing
an easier life for the compiler since for being static less time
is required for optimization

***** Config
#+begin_src elisp
(use-package org
  :ensure
  :config
  (map ju-notes-map
       "c" #'org-capture)
  (map org-mode-map
       "C-t" 'ju-menu-map
       "C-," #'execute-extended-command
       "C-c d" #'org-todo
       "C-c h" #'consult-org-heading
       "C-c TAB" #'mode-line-other-buffer
       "C-c C-t" #'+org-toggle-todo-and-fold
       "C-c C-d" #'org-babel-demarcate-block
       "TAB" #'org-cycle
       "<up>" #'org-move-subtree-up
       "<down>" #'org-move-subtree-down
       "<left>" #'org-demote-subtree
       "<right>" #'org-promote-subtree)

  ;; Org Src editing goes on the side (better to edit)
  (noct-handle-popup (rx "*Org Src " (+ any) "*" eol) nil right)

  (csetq org-capture-bookmark nil)
  (setq require-final-newline t)
  (setq org-directory user-notes-dir
        org-default-notes-file (expand "00000000T000011--notes.org" user-notes-dir))

  ;; run after a resettable delay of 0.3 seconds.
  ;;  (debounce! 'org-agenda-do-context-action 0.3)
  (setq org-tab-first-hook #'+org-cycle-only-current-subtree-h)

  (setq org-use-speed-commands t)

  ;; Allow org snippets with `<`
  (add-to-list 'org-modules 'org-tempo)
  (setq org-structure-template-alist
        '(("c" . "comment")
          ("e" . "src elisp")
          ("E" . "example")
          ("h" . "export html")
          ("l" . "export latex")
          ("q" . "quote")
          ("s" . "src")
          ("r" . "src rust")
          ("x" . "export")))

  ;; display images
  (setq org-display-remote-inline-images t
        org-startup-with-inline-images t
        org-cycle-inline-images-display t)

  ;; better default
  (setq org-catch-invisible-edits nil
        org-hide-emphasis-markers t
        org-enforce-todo-dependencies t)

  ;; indent
  (setq org-startup-folded t
        org-startup-indented t
        org-list-indent-offset 2
        org-pretty-entities t
        org-cycle-separator-lines 2)

  ;; Agenda
  (setq org-agenda-custom-commands
        '(("c" "Calendar" agenda ""
           ((org-agenda-span 7)
            (org-agenda-start-on-weekday 0)
            (org-agenda-time-grid nil)
            (org-agenda-repeating-timestamp-show-all t)
            (org-agenda-entry-types '(:timestamp :sexp))))

          ("d" "Upcoming deadlines" agenda ""
           ((org-agenda-time-grid nil)
            (org-deadline-warning-days 365)
            (org-agenda-entry-types '(:deadline))))

          ("o" "Today" tags-todo "@dev"
           ((org-agenda-overriding-header "Development")
            (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))

          ("g" . "GTD contexts")
          ("gd" "Dev" tags-todo "development")
          ("gs" "Computer" tags-todo "studies")
          ("gp" "Projects" tags-todo "projects")))

  (setq org-agenda-files (list (concat org-directory "00000000T000001--agenda.org")))

  ;; Save Org buffers after refiling!
  ;; Removed: fill `recentf' list
  ;; (advice-add 'org-refile :after 'org-save-all-org-buffers)
  (csetq org-tag-alist
         '((:startgroup)
           (:endgroup)
           ("@errand" . ?E)
           ("@home" . ?H)
           ("@work" . ?W)
           ("agenda" . ?a)
           ("event" . ?e)
           ("planning" . ?p)
           ("blog" . ?b)
           ("idea" . ?i)))

  (csetq org-todo-keywords
         '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
           (sequence "EVENT(e)" "|" "TRYST(y)")
           (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)"))
         org-todo-keyword-faces
         '(("TODO" :foreground "#f9667a" :weight bold)
           ("NEXT" :foreground "#86b2d3" :weight bold)
           ("DONE" :foreground "#4b93ab" :weight bold)
           ("EVENT" :foreground "#bab4fe" :weight bold)
           ("WAITING" :foreground "#f9b37f" :weight bold)
           ("HOLD" :foreground "#bab4fe" :weight bold)
           ("CANCELLED" :foreground "#a3bbae" :weight bold)
           ("MEETING" :foreground "#a3bbae" :weight bold)
           ("PHONE" :foreground "#a3bbae" :weight bold)))

  (add-hook 'kill-emacs-hook #'ju/org--clock-out)

  ;; Babel
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((C . t)
     (sql . t)
     (python . t)
     (emacs-lisp . t)))
  (setq-default org-confirm-babel-evaluate nil
                 org-src-fontify-natively t
                 org-src-tab-acts-natively t)

#+end_src

****** Preface (loaded before anything else)
#+begin_src elisp
:preface
(defun ju.org-toggle-todo-and-fold ()
  (interactive)
  (save-excursion
    (org-back-to-heading t) ;; Make sure command works even if point is
    ;; below target heading
    (cond ((looking-at "\*+ TODO")
           (org-todo "DONE")
           (outline-hide-subtree))
          ((looking-at "\*+ DONE")
           (org-todo "TODO")
           (outline-hide-subtree))
          (t (message "Can only toggle between TODO and DONE.")))))
(size-indication-mode)

(defun ju/org--clock-out()
  (org-clock-out nil t))

(defun my-org-agenda-skip-all-siblings-but-first ()
  "Skip all but the first non-done entry."
  (let (should-skip-entry)
    (unless (org-current-is-todo)
      (setq should-skip-entry t))
    (save-excursion
      (while (and (not should-skip-entry) (org-goto-sibling t))
        (when (org-current-is-todo)
          (setq should-skip-entry t))))
    (when should-skip-entry
      (or (outline-next-heading)
          (goto-char (point-max))))))

(defun org-current-is-todo ()
  (string= "TODO" (org-get-todo-state)))
#+end_src

End of org block
#+begin_src elisp
) ;; End of `use-package org`
#+end_src

