layers/notes.el
;; support to append notes on PDF, EPub and others
(use-package org-noter
  :ensure t
  :custom
  ;; Save the last location you visited and pick it up when you start another session
  (org-noter-auto-save-last-location t))

(use-package org-special-block-extras
  :hook (org-mode . org-special-block-extras-mode)
  :config
  (org-defblock noweb-template
                (:tangle "no" :backend emacs-lisp :noweb yes :noweb-ref nil)
                "Generate a template for config"))

(use-package org-modern
  :ensure t
  :hook (org-mode . global-org-modern-mode)
  :config
  (set-face-attribute 'org-modern-symbol nil :family fixed-pitch-font))

(use-package org-pdftools
  :after org-noter)

;; A kind of spaced repetition tool
(use-package org-drill)

;; Show marks on cursor
(use-package org-appear
  :ensure t
  :init
  (add-hook 'org-mode-hook 'org-appear-mode))

(defvar emacs-assets-dir (expand "assets/" emacs-dir))

(use-package org-pomodoro
  :ensure t
  :after org
  :commands (org-pomodoro-start org-pomodoro)
  :bind (("<f12>" . work-pomodoro))
  ;; :hook ((org-pomodoro-started . ju/load-window-close-agenda)
  ;;        (org-pomodoro-finished . ju/save-window-show-agenda))
  :config
  ;; Send visual notification when a timer ends
  (csetq alert-user-configuration '(((((:category . "org-pomodoro")) libnotify nil))))
  (csetq org-pomodoro-format "%s"
         org-pomodoro-start-sound (expand "bells.wav" emacs-assets-dir)
         org-pomodoro-finished-sound (expand "bells.wav" emacs-assets-dir)
         org-pomodoro-overtime-sound (expand "bells.wav" emacs-assets-dir)
         org-pomodoro-long-break-sound (expand "singing-bowl.wav" emacs-assets-dir)
         org-pomodoro-short-break-sound (expand "singing-bowl.wav" emacs-assets-dir)
         org-pomodoro-clock-break t
         org-pomodoro-manual-break t)

  (defun meditate-pomodoro ()
    (interactive)
    (csetq org-pomodoro-length 10)
    (org-pomodoro-start))

  (defun work-pomodoro ()
    (interactive)
    (csetq org-pomodoro-length 25
           org-pomodoro-short-break-length 5
           org-pomodoro-long-break-length 20)
    (if (not (org-pomodoro-active-p))
        (progn
          (org-pomodoro-start)
          (message "Pomodoro started/unpaused"))
      (progn
        (org-pomodoro t)
        (message "Pomodoro Paused"))))

  (defun ju/save-window-show-agenda ()
    (interactive)
    (window-configuration-to-register "`")
    (delete-other-windows)
    (org-save-all-org-buffers)
    (org-agenda nil "w"))

  (defun ju/load-window-close-agenda ()
    (interactive)
    (org-save-all-org-buffers)
    (jump-to-register "`")))

(use-package org-journal
  :config
  (map ju-notes-map
   "t" '(org-journal-open-current-journal-file :wk "Today's journal")
   "o" '(org-journal-new-entry :wk "Open journal"))

  (setq
   org-journal-date-prefix "#+title: "
   org-journal-file-format "%Y-%m-%d.org"
   org-journal-dir (expand "private/journal" user-notes-dir)
   org-journal-date-format "%A, %d %B %Y"))

(use-package org-superstar
  :hook (org-mode .  org-superstar-mode)
  :disabled t
  :custom
  (set-face-attribute 'org-superstar-item nil :height 0.8)
  (set-face-attribute 'org-superstar-header-bullet nil :height 0.8)
  (set-face-attribute 'org-superstar-leading nil :height 0.8)
  (org-ellipsis " ⋯")
  (org-superstar-special-todo-items t)
  (org-superstar-headline-bullets-list '("⁖" "•" "•" "•" "•" "•")) ;;  usechar ⁖`'  if first symbol don't work
  (org-superstar-item-bullet-alist '((?* . ?•) (?+ . ?▹) (?- . ?◦)))) ; changes +/- symbols in item lists

(use-package toc-org
  :config
  ;; enable in markdown, too
  (add-hook 'markdown-mode-hook 'toc-org-mode))
(defun tangle-reload ()
  (interactive)
  (let ((org-file (concat emacs-dir "cfg.org"))
        (init-file (concat emacs-dir "init.el")))
    (org-babel-tangle-file org-file) (load init-file)))

(use-package org-download
  :config
  (setq org-download-display-inline-images t
        org-download-image-dir (expand "_img" user-notes-dir))
  :gfhook
  ('dired-mode-hook 'org-download-enable))

;;; notes.el ends here
(use-package bug-hunter
  :ensure (:host github :repo "Malabarba/elisp-bug-hunter"))

(use-package org-roam
  :disabled t
  :config
  (setq org-roam-db-gc-threshold most-positive-fixnum)
  (setq org-roam-directory (expand user-notes-dir))
  (setq org-id-extra-files (org-roam--list-files org-roam-directory))

  (setq org-roam-capture-templates
        '(("d" "default" plain "%?"
           :immediate-finish t
           :if-new (file+head "${slug}.org"
                              "#+TITLE: ${title}\n#+lastmod: Time-stamp: <>\n\n")
           :unnarrowed t)
          ("t" "temp" plain "%?"
           :if-new(file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                             "#+TITLE: ${title}\n#+lastmod: Time-stamp: <>\n\n")
           :immediate-finish t
           :unnarrowed t)
          ("p" "private" plain "%?"
           :if-new (file+head "${slug}-private.org"
                              "#+TITLE: ${title}\n")
           :immediate-finish t
           :unnarrowed t)))

  (setq org-roam-node-display-template
        (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))

  (setq org-roam-completion-system 'vertico
        org-roam-completion-everywhere t
        org-roam-mode-sections
        '(#'org-roam-backlinks-section
          #'org-roam-reflinks-section
          #'org-roam-unlinked-references-section))

  (org-roam-db-autosync-mode))
(use-package denote
  :ensure t
  :init
  (require 'denote-org-extras)
  (denote-rename-buffer-mode t)
  :hook
  (find-file-hook . denote-link-buttonize-buffer)
  (dired-mode . denote-dired-mode)
  :custom-face
  (denote-faces-link ((t (:slant italic))))
  :custom
  (denote-known-keywords '("rust"
                           "emacs"
                           "CS"
                           "philosophy"
                           "politics"
                           "economics"))
  :config
  (defun my-denote-tmr ()
    (interactive)
    (tmr "10" "Practice writing in my journal"))
  (add-hook 'denote-journal-extras-hook 'my-denote-tmr)

  (csetq denote-directory user-notes-dir)
  (map ju-notes-map
       "n" #'denote-create-note
       "j" #'denote-journal-extras-new-or-existing-entry
       "d" #'denote-date
       "i" #'denote-link-or-create
       "l" #'denote-find-link
       "b" #'denote-find-backlink
       "D" #'denote-org-dblock-insert-links
       "r" #'denote-rename-file-using-front-matter
       "R" #'denote-rename-file
       "k" #'denote-keywords-add
       "K" #'denote-keywords-remove))
;;; Calendar
