layers/notes.el
(map calendar-mode-map
     "n" #'calendar-forward-week
     "d" #'calendar-backward-week
     ;; forward:  f & t (t dvorak vim-like eq. j in qwerty)
     "t" #'calendar-forward-day
     "T" #'calendar-forward-month
     "f" #'calendar-forward-day
     "F" #'calendar-forward-month
     ;; backwards: b & h (h dvorak vim-like eq. k)
     "h" #'calendar-backward-day
     "H" #'calendar-backward-month
     "b" #'calendar-backward-day
     "B" #'calendar-backward-month)
;;; notes.el ---  desc  -*- lexical-binding: t; -*-
;;; Commentary:
;; https://www.reddit.com/r/emacs/comments/d7x7x8/finally_fixing_indentation_of_quoted_lists/
;; https://emacs.stackexchange.com/questions/10230/how-to-indent-keywords-aligned
;;; Code:
(require 'core-packages)
(require 'core-lib)
(require 'keymaps)

(use-package dogears
  :ensure t
  :init
  (dogears-mode 1))

;; Denote extensions
(use-package consult-notes
  :ensure t
  :after denote
  :commands (consult-notes
             consult-notes-search-in-all-notes)
  :init
  (csetq consult-notes-file-dir-sources (list `("All" 'a "~/notes")))
  (consult-notes-denote-mode)
  (map leader-map "C-n" #'consult-notes)
  (map ju-notes-map
       "f" #'consult-notes
       "s" #'consult-notes-search-in-all-notes))

(use-package org-sticky-header
  :ensure t
  :hook (org-mode . org-sticky-header-mode))

(use-package org-gtd
  :disabled t
  :ensure t
  :after org
  :init
  (setq ju-gtd-map (make-sparse-keymap))
  (map ju-notes-map
       "g" (cons "GTD" ju-gtd-map))

  (map ju-gtd-map
       "c" (cons "GTD: Capture" #'org-gtd-capture)
       "p" (cons "GTD: Process" #'org-gtd-process-inbox)
       "e" (cons "GTD: Engage" #'org-gtd-engage)
       "o" (cons "GTD: Organize" #'org-gtd-organize))

  (csetq org-gtd-update-ack "3.0.0"
         org-gtd-directory user-notes-dir))

;; Easy insertion of weblinks
(use-package org-web-tools)
(use-package ob-mermaid)

(use-package persistent-scratch
  :hook
  (after-init . persistent-scratch-setup-default)
  :init
  (persistent-scratch-autosave-mode)
  (csetq persistent-scratch-save-file (concat cache-dir "permanent-scratch.org")
         persistent-scratch-backup-directory (concat cache-dir "perm-scratch/"))
  :config
  (map ju-menu-map "x" #'scratch-buffer))

;; Modernise Org mode interface
(use-package olivetti
  :demand t)


(use-package org-bookmark-heading
  :ensure t)

(provide 'notes)
